Lotlab/nrf52-keyboard/usb/CH554_SDCC.h
/*  UART0 Registers  */
SFR(SCON, 0x98);         // UART0 control (serial port control)
 SBIT(SM0, 0x98, 7);       // UART0 mode bit0, selection data bit: 0=8 bits data, 1=9 bits data
 SBIT(SM1, 0x98, 6);       // UART0 mode bit1, selection baud rate: 0=fixed, 1=variable
// SM0 & SM1: UART0 mode
//    00 - mode 0, shift Register, baud rate fixed at: Fsys/12
//    01 - mode 1, 8-bit UART,     baud rate = variable by timer1 or timer2 overflow rate
//    10 - mode 2, 9-bit UART,     baud rate fixed at: Fsys/128@SMOD=0, Fsys/32@SMOD=1
//    11 - mode 3, 9-bit UART,     baud rate = variable by timer1 or timer2 overflow rate
 SBIT(SM2, 0x98, 5);       // enable multi-device communication in mode 2/3
#define MASK_UART0_MOD    0xE0      // bit mask of UART0 mode
 SBIT(REN, 0x98, 4);       // enable UART0 receiving
 SBIT(TB8, 0x98, 3);       // the 9th transmitted data bit in mode 2/3
 SBIT(RB8, 0x98, 2);       // 9th data bit received in mode 2/3, or stop bit received for mode 1
 SBIT(TI, 0x98, 1);       // transmit interrupt flag, set by hardware after completion of a serial transmittal, need software clear
 SBIT(RI, 0x98, 0);       // receive interrupt flag, set by hardware after completion of a serial receiving, need software clear
SFR(SBUF, 0x99);         // UART0 data buffer: reading for receiving, writing for transmittal

/*  Timer2/Capture2 Registers  */
SFR(T2CON, 0xC8);         // timer 2 control
 SBIT(TF2, 0xC8, 7);      // timer2 overflow & interrupt flag, need software clear, the flag will not be set when either RCLK=1 or TCLK=1
 SBIT(CAP1F, 0xC8, 7);      // timer2 capture 1 interrupt flag, set by T2 edge trigger if bT2_CAP1_EN=1, need software clear
 SBIT(EXF2, 0xC8, 6);      // timer2 external flag, set by T2EX edge trigger if EXEN2=1, need software clear
 SBIT(RCLK, 0xC8, 5);      // selection UART0 receiving clock: 0=timer1 overflow pulse, 1=timer2 overflow pulse
 SBIT(TCLK, 0xC8, 4);      // selection UART0 transmittal clock: 0=timer1 overflow pulse, 1=timer2 overflow pulse
 SBIT(EXEN2, 0xC8, 3);      // enable T2EX trigger function: 0=ignore T2EX, 1=trigger reload or capture by T2EX edge
 SBIT(TR2, 0xC8, 2);      // timer2 run enable
 SBIT(C_T2, 0xC8, 1);      // timer2 clock source selection: 0=timer base internal clock, 1=external edge counter base T2 falling edge
 SBIT(CP_RL2, 0xC8, 0);      // timer2 function selection (force 0 if RCLK=1 or TCLK=1): 0=timer and auto reload if count overflow or T2EX edge, 1=capture by T2EX edge
SFR(T2MOD, 0xC9);         // timer 2 mode and timer 0/1/2 clock mode
#define bTMR_CLK          0x80      // fastest internal clock mode for timer 0/1/2 under faster clock mode: 0=use divided clock, 1=use original Fsys as clock without dividing
#define bT2_CLK           0x40      // timer2 internal clock frequency selection: 0=standard clock, Fsys/12 for timer mode, Fsys/4 for UART0 clock mode,
                                    //   1=faster clock, Fsys/4 @bTMR_CLK=0 or Fsys @bTMR_CLK=1 for timer mode, Fsys/2 @bTMR_CLK=0 or Fsys @bTMR_CLK=1 for UART0 clock mode
#define bT1_CLK           0x20      // timer1 internal clock frequency selection: 0=standard clock, Fsys/12, 1=faster clock, Fsys/4 if bTMR_CLK=0 or Fsys if bTMR_CLK=1
#define bT0_CLK           0x10      // timer0 internal clock frequency selection: 0=standard clock, Fsys/12, 1=faster clock, Fsys/4 if bTMR_CLK=0 or Fsys if bTMR_CLK=1
#define bT2_CAP_M1        0x08      // timer2 capture mode high bit
#define bT2_CAP_M0        0x04      // timer2 capture mode low bit
// bT2_CAP_M1 & bT2_CAP_M0: timer2 capture point selection
//   x0: from falling edge to falling edge
//   01: from any edge to any edge (level changing)
//   11: from rising edge to rising edge
#define T2OE              0x02      // enable timer2 generated clock output: 0=disable output, 1=enable clock output at T2 pin, frequency = TF2/2
#define bT2_CAP1_EN       0x01      // enable T2 trigger function for capture 1 of timer2 if RCLK=0 & TCLK=0 & CP_RL2=1 & C_T2=0 & T2OE=0
SFR16(RCAP2, 0xCA);         // reload & capture value, little-endian
SFR(RCAP2L, 0xCA);         // low byte of reload & capture value
SFR(RCAP2H, 0xCB);         // high byte of reload & capture value
SFR16(T2COUNT, 0xCC);         // counter, little-endian
SFR(TL2, 0xCC);         // low byte of timer 2 count
SFR(TH2, 0xCD);         // high byte of timer 2 count
SFR16(T2CAP1, 0xCE);         // ReadOnly: capture 1 value for timer2
SFR(T2CAP1L, 0xCE);         // ReadOnly: capture 1 value low byte for timer2
SFR(T2CAP1H, 0xCF);         // ReadOnly: capture 1 value high byte for timer2

/*  PWM1/2 Registers  */
SFR(PWM_DATA2, 0x9B);         // PWM data for PWM2
SFR(PWM_DATA1, 0x9C);         // PWM data for PWM1
SFR(PWM_CTRL, 0x9D);         // PWM 1/2 control
#define bPWM_IE_END       0x80      // enable interrupt for PWM mode cycle end
#define bPWM2_POLAR       0x40      // PWM2 output polarity: 0=default low and high action, 1=default high and low action
#define bPWM1_POLAR       0x20      // PWM1 output polarity: 0=default low and high action, 1=default high and low action
#define bPWM_IF_END       0x10      // interrupt flag for cycle end, write 1 to clear or write PWM_CYCLE or load new data to clear
#define bPWM2_OUT_EN      0x08      // PWM2 output enable
#define bPWM1_OUT_EN      0x04      // PWM1 output enable
#define bPWM_CLR_ALL      0x02      // force clear FIFO and count of PWM1/2
SFR(PWM_CK_SE, 0x9E);         // clock divisor setting

/*  SPI0/Master0/Slave Registers  */
SFR(SPI0_STAT, 0xF8);         // SPI 0 status
 SBIT(S0_FST_ACT, 0xF8, 7);  // ReadOnly: indicate first byte received status for SPI0
 SBIT(S0_IF_OV, 0xF8, 6);  // interrupt flag for slave mode FIFO overflow, direct bit address clear or write 1 to clear
 SBIT(S0_IF_FIRST, 0xF8, 5);  // interrupt flag for first byte received, direct bit address clear or write 1 to clear
 SBIT(S0_IF_BYTE, 0xF8, 4);  // interrupt flag for a byte data exchanged, direct bit address clear or write 1 to clear or accessing FIFO to clear if bS0_AUTO_IF=1
 SBIT(S0_FREE, 0xF8, 3);  // ReadOnly: SPI0 free status
 SBIT(S0_T_FIFO, 0xF8, 2);  // ReadOnly: tx FIFO count for SPI0
 SBIT(S0_R_FIFO, 0xF8, 0);  // ReadOnly: rx FIFO count for SPI0
SFR(SPI0_DATA, 0xF9);         // FIFO data port: reading for receiving, writing for transmittal
SFR(SPI0_CTRL, 0xFA);         // SPI 0 control
#define bS0_MISO_OE       0x80      // SPI0 MISO output enable
#define bS0_MOSI_OE       0x40      // SPI0 MOSI output enable
#define bS0_SCK_OE        0x20      // SPI0 SCK output enable
#define bS0_DATA_DIR      0x10      // SPI0 data direction: 0=out(master_write), 1=in(master_read)
#define bS0_MST_CLK       0x08      // SPI0 master clock mode: 0=mode 0 with default low, 1=mode 3 with default high
#define bS0_2_WIRE        0x04      // enable SPI0 two wire mode: 0=3 wire (SCK+MOSI+MISO), 1=2 wire (SCK+MISO)
#define bS0_CLR_ALL       0x02      // force clear FIFO and count of SPI0
#define bS0_AUTO_IF       0x01      // enable FIFO accessing to auto clear S0_IF_BYTE interrupt flag
SFR(SPI0_CK_SE, 0xFB);         // clock divisor setting
//SFR(SPI0_S_PRE, 0xFB);         // preset value for SPI slave
#define SPI0_S_PRE        SPI0_CK_SE
SFR(SPI0_SETUP, 0xFC);         // SPI 0 setup
#define bS0_MODE_SLV      0x80      // SPI0 slave mode: 0=master, 1=slave
#define bS0_IE_FIFO_OV    0x40      // enable interrupt for slave mode FIFO overflow
#define bS0_IE_FIRST      0x20      // enable interrupt for first byte received for SPI0 slave mode
#define bS0_IE_BYTE       0x10      // enable interrupt for a byte received
#define bS0_BIT_ORDER     0x08      // SPI0 bit data order: 0=MSB first, 1=LSB first
#define bS0_SLV_SELT      0x02      // ReadOnly: SPI0 slave mode chip selected status: 0=unselected, 1=selected
#define bS0_SLV_PRELOAD   0x01      // ReadOnly: SPI0 slave mode data pre-loading status just after chip-selection

